{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 512,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[BOS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[EOS]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[BOS]": {
        "id": "[BOS]",
        "ids": [
          2
        ],
        "tokens": [
          "[BOS]"
        ]
      },
      "[EOS]": {
        "id": "[EOS]",
        "ids": [
          3
        ],
        "tokens": [
          "[EOS]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[BOS]": 2,
      "[EOS]": 3,
      "B005AL5H9S": 4,
      "B009GPP546": 5,
      "B00O2FGBJS": 6,
      "B00TK0VV68": 7,
      "B015A5DGG4": 8,
      "B01EK2F1PC": 9,
      "B01M24DUXH": 10,
      "B01MA3LXIL": 11,
      "B01MSF13T1": 12,
      "B01N7A5AGF": 13,
      "B0713VF172": 14,
      "B076DBLG1K": 15,
      "B07D5FBFQ4": 16,
      "B07DFNPVSF": 17,
      "B07DKRK8ZW": 18,
      "B07FP2C8N8": 19,
      "B07FPS2VFK": 20,
      "B07HN1L8NQ": 21,
      "B07HR754WV": 22,
      "B07HVRP37G": 23,
      "B07J1LYVHC": 24,
      "B07J3GH1W1": 25,
      "B07JGD2T2J": 26,
      "B07KG1TWP5": 27,
      "B07KXM94BT": 28,
      "B07L9H27SH": 29,
      "B07LCHCD6Q": 30,
      "B07M9D3WYW": 31,
      "B07MMW5654": 32,
      "B07MN1KJ15": 33,
      "B07MZT83KK": 34,
      "B07ND4HPHT": 35,
      "B07NPCT6L5": 36,
      "B07NPWK167": 37,
      "B07P4LLZS6": 38,
      "B07PBWVV5K": 39,
      "B07PCGSFGQ": 40,
      "B07PCSRSND": 41,
      "B07PHWX88W": 42,
      "B07PZ8JNWJ": 43,
      "B07R3BMYBG": 44,
      "B07RBSLNFR": 45,
      "B07RM722DH": 46,
      "B07SLFWZKN": 47,
      "B07SV4HTMC": 48,
      "B07SW7D6ZR": 49,
      "B07SY7WPS4": 50,
      "B07T3Z58HL": 51,
      "B07T4LKC4D": 52,
      "B07THLR7RR": 53,
      "B07TLMZL3T": 54,
      "B07VDCD17L": 55,
      "B07VG2W8TT": 56,
      "B07VGBBNTH": 57,
      "B07VQR3W3Z": 58,
      "B07W1WJZFG": 59,
      "B07W397QG4": 60,
      "B07WNBZQGT": 61,
      "B07X8W7GJZ": 62,
      "B07XVNJFNF": 63,
      "B07YG4PRTN": 64,
      "B07YL4485K": 65,
      "B07YNDWRCB": 66,
      "B07YS9W97B": 67,
      "B07YV9J2YZ": 68,
      "B07Z3NRMBS": 69,
      "B07Z4CVTRP": 70,
      "B07Z548TKH": 71,
      "B07ZJX5MNJ": 72,
      "B07ZQRX7FX": 73,
      "B07ZS3DKL5": 74,
      "B0813ZQG3T": 75,
      "B081632HX6": 76,
      "B081D2R47W": 77,
      "B081M5R5L5": 78,
      "B081MQD52C": 79,
      "B081ZN3TD5": 80,
      "B082DXHTX8": 81,
      "B082MDFNZM": 82,
      "B082NKQ4ZT": 83,
      "B082VKPJV5": 84,
      "B082VYX7G8": 85,
      "B083122WRC": 86,
      "B08343FS9P": 87,
      "B0837K9W6P": 88,
      "B083B67373": 89,
      "B083BGJ4P9": 90,
      "B083J1Y349": 91,
      "B083PXJBVY": 92,
      "B083TLNBJJ": 93,
      "B0841WQNNZ": 94,
      "B0842BXM5M": 95,
      "B0844X21MJ": 96,
      "B0845LNDJK": 97,
      "B084WP4XS8": 98,
      "B084ZHP45Y": 99,
      "B0851C4YPC": 100,
      "B0851QJPZY": 101,
      "B0851T7HDS": 102,
      "B0855L611L": 103,
      "B08575Y9V3": 104,
      "B0859CYSTM": 105,
      "B085J24382": 106,
      "B085J354CL": 107,
      "B085MCMZLX": 108,
      "B085NYYLQ8": 109,
      "B085QDWHQJ": 110,
      "B085RQKWNF": 111,
      "B085RS26YH": 112,
      "B085SY4WC3": 113,
      "B085TFXLH1": 114,
      "B085ZRVDKP": 115,
      "B0863FZFPV": 116,
      "B08693T3XR": 117,
      "B086GST51S": 118,
      "B086JN17SK": 119,
      "B086M8MZGB": 120,
      "B086MN4SRX": 121,
      "B086N136NH": 122,
      "B086N2SY91": 123,
      "B086Q2J3F2": 124,
      "B086SSHLWT": 125,
      "B086ST4W1C": 126,
      "B086TS3BKQ": 127,
      "B086VK22QT": 128,
      "B086VRRD99": 129,
      "B086VYKNDF": 130,
      "B086W18W1W": 131,
      "B086XH7BWW": 132,
      "B086YBQ8M7": 133,
      "B0876VC4KM": 134,
      "B087D7MVHB": 135,
      "B087F14JSH": 136,
      "B087FTZSZH": 137,
      "B087G54FLM": 138,
      "B087GB8ZRF": 139,
      "B087GD4BJ1": 140,
      "B087J3H22J": 141,
      "B087PJ121M": 142,
      "B087Z9X39L": 143,
      "B087ZQG11L": 144,
      "B087ZQK2G8": 145,
      "B0885W8GCL": 146,
      "B08879N2W3": 147,
      "B0888CX245": 148,
      "B088FBNQXW": 149,
      "B088GWCVVJ": 150,
      "B088LPYXNQ": 151,
      "B088LWRYJC": 152,
      "B088M5P8FN": 153,
      "B088NVJSJT": 154,
      "B088PYN4VM": 155,
      "B088TGQFNM": 156,
      "B088TXBCB5": 157,
      "B088TYPM71": 158,
      "B088X2WPTX": 159,
      "B088YHN4JT": 160,
      "B088ZVSLYP": 161,
      "B0895FHBVG": 162,
      "B0895XPZNT": 163,
      "B089CSF11Y": 164,
      "B089CSR3KF": 165,
      "B089D16BWJ": 166,
      "B089KBMST6": 167,
      "B089NJG212": 168,
      "B089QR2Y5B": 169,
      "B089R7S73D": 170,
      "B089RLLT5C": 171,
      "B089YGZZYP": 172,
      "B089ZQ8Y95": 173,
      "B08B3SJNL5": 174,
      "B08B3TCMSQ": 175,
      "B08B5FJMHM": 176,
      "B08BB3P4VQ": 177,
      "B08BF4BKKM": 178,
      "B08BFH35VX": 179,
      "B08BKWLHYP": 180,
      "B08BLKFGND": 181,
      "B08BLX72TP": 182,
      "B08BRS98SF": 183,
      "B08BS3WDPJ": 184,
      "B08BXVJMRY": 185,
      "B08BY91SGT": 186,
      "B08BY9P4HR": 187,
      "B08BYK8SKR": 188,
      "B08BYKQS9S": 189,
      "B08BZ1RHPS": 190,
      "B08C24Q6LB": 191,
      "B08C2T24WG": 192,
      "B08C37KWRR": 193,
      "B08C71WBLC": 194,
      "B08C72C56Z": 195,
      "B08CC6YRLJ": 196,
      "B08CH5PC9W": 197,
      "B08CL46XNM": 198,
      "B08CVCLVS2": 199,
      "B08CVTNQP1": 200,
      "B08CZ5JZMZ": 201,
      "B08D6PPL42": 202,
      "B08DHZW3LK": 203,
      "B08DK4NDM3": 204,
      "B08DK5D9J5": 205,
      "B08DK74M1P": 206,
      "B08DKFV9SR": 207,
      "B08DNCR582": 208,
      "B08DRBZNZJ": 209,
      "B08DXCVRNY": 210,
      "B08DXLRTSB": 211,
      "B08DXZ5VXB": 212,
      "B08F4ZDVZQ": 213,
      "B08F7877DC": 214,
      "B08F79Z1Q5": 215,
      "B08FBHNBP1": 216,
      "B08FD2KP9R": 217,
      "B08G149DSD": 218,
      "B08G4Y4SFV": 219,
      "B08G5YVHQP": 220,
      "B08G83G24X": 221,
      "B08GC5GSNG": 222,
      "B08GJJ5RV9": 223,
      "B08GKVYS1Y": 224,
      "B08GMC48QF": 225,
      "B08GS1G9BH": 226,
      "B08GYJY8F2": 227,
      "B08H4SYXR4": 228,
      "B08HCMNLKD": 229,
      "B08HDG9F44": 230,
      "B08HGZXLP6": 231,
      "B08HMLXW65": 232,
      "B08HQSK576": 233,
      "B08HRHCZV2": 234,
      "B08HRNPNR5": 235,
      "B08HVRP54L": 236,
      "B08HXQ3T9K": 237,
      "B08HZ5Y8RY": 238,
      "B08J7R5HHX": 239,
      "B08JCX3DL7": 240,
      "B08JPKXJMV": 241,
      "B08JTNQFZY": 242,
      "B08JZD8HN4": 243,
      "B08K2V6WGH": 244,
      "B08K2WH8LK": 245,
      "B08K8P7LN6": 246,
      "B08KGVBW41": 247,
      "B08KHRF9NY": 248,
      "B08KJF6Y6C": 249,
      "B08KT7FCYY": 250,
      "B08KWN77LW": 251,
      "B08KY7VYDS": 252,
      "B08L3J4FB9": 253,
      "B08L3W279N": 254,
      "B08L4HTQ3R": 255,
      "B08L6GXY2S": 256,
      "B08LG68MGH": 257,
      "B08LPGZMQK": 258,
      "B08LPJT4MT": 259,
      "B08LYT4Q2X": 260,
      "B08LZ6W8RF": 261,
      "B08MC3ZLV4": 262,
      "B08MPK4JRB": 263,
      "B08MRRNL18": 264,
      "B08MT8L5ZL": 265,
      "B08N5NDVGH": 266,
      "B08N6CLJ6P": 267,
      "B08N6YHQXT": 268,
      "B08N9RT9YD": 269,
      "B08NC4378M": 270,
      "B08NJ5BTWG": 271,
      "B08NPBQR9L": 272,
      "B08NTD1NM1": 273,
      "B08P15TB2V": 274,
      "B08P2DZB4X": 275,
      "B08P4YQ3K5": 276,
      "B08P5579KC": 277,
      "B08P7PSMRR": 278,
      "B08PLFZB89": 279,
      "B08PTZL95G": 280,
      "B08PVH18Z6": 281,
      "B08Q3F3L7S": 282,
      "B08QFGV5ZQ": 283,
      "B08QHP717Z": 284,
      "B08QKXY1KN": 285,
      "B08QVJ4NVD": 286,
      "B08R3F946X": 287,
      "B08RQZ3F3L": 288,
      "B08RRSPNWV": 289,
      "B08RY6S25W": 290,
      "B08RYN11N9": 291,
      "B08S1LWF9V": 292,
      "B08S2LYN64": 293,
      "B08S3B8Y5G": 294,
      "B08SBV6Z57": 295,
      "B08SG2MBRY": 296,
      "B08SJKR877": 297,
      "B08SQ31H8P": 298,
      "B08SQZ1B3W": 299,
      "B08T7GPT1D": 300,
      "B08TB3DZ1D": 301,
      "B08TR1MKHD": 302,
      "B08VDCWKHV": 303,
      "B08VJ7CZW3": 304,
      "B08VKQY815": 305,
      "B08VQY1Z1S": 306,
      "B08W4WQMNM": 307,
      "B08W8LKLHB": 308,
      "B08WCQWP3T": 309,
      "B08WF29DM9": 310,
      "B08XJWLLKQ": 311,
      "B08XQYZWCS": 312,
      "B08XZDXTG2": 313,
      "B08YJV9YL2": 314,
      "B08YNR839W": 315,
      "B0912BNP4J": 316,
      "B0914JBBTV": 317,
      "B0919R1CYT": 318,
      "B091GG4N2X": 319,
      "B092M5K59T": 320,
      "B0932Z1NM1": 321,
      "B093H28PD4": 322,
      "B0941YDPSW": 323,
      "B09473GGM4": 324,
      "B0949MJRHK": 325,
      "B09571TNVG": 326,
      "B095C1WF44": 327,
      "B095CG2ZV1": 328,
      "B09671G4KH": 329,
      "B096S4RQNH": 330,
      "B096YHL82K": 331,
      "B0977LVHF8": 332,
      "B0994HWXVV": 333,
      "B0998BD871": 334,
      "B099959RFF": 335,
      "B09BJM95J7": 336,
      "B09BKK8G76": 337,
      "B09C5NQSC5": 338,
      "B09FNTZFZZ": 339,
      "B09G22586Y": 340,
      "B09G3KBK7Y": 341,
      "B09GNXK3N1": 342,
      "B09GVHT2D3": 343,
      "B09HMXY36F": 344,
      "B09JLSCTR3": 345,
      "B09KX5N1DR": 346,
      "B09KYJJ3D5": 347,
      "B09L33VJCL": 348,
      "B09LWV3HH2": 349,
      "B09NFQ69KT": 350,
      "B09SH1FD9S": 351,
      "B09TTC9Q9W": 352,
      "B0B2L218H2": 353,
      "B0B4MR9BXN": 354,
      "B0B8SFDJN9": 355,
      "B0BC273JJR": 356,
      "B0BG6WX4DH": 357,
      "B0BTJ6SYKB": 358,
      "B0BVQQ58G8": 359
    },
    "unk_token": "[UNK]"
  }
}