{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": {
      "Fixed": 128
    },
    "direction": "Left",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[BOS]": 2,
      "[EOS]": 3,
      "<a_100>": 4,
      "<a_107>": 5,
      "<a_112>": 6,
      "<a_114>": 7,
      "<a_127>": 8,
      "<a_138>": 9,
      "<a_148>": 10,
      "<a_153>": 11,
      "<a_159>": 12,
      "<a_177>": 13,
      "<a_180>": 14,
      "<a_187>": 15,
      "<a_190>": 16,
      "<a_207>": 17,
      "<a_221>": 18,
      "<a_249>": 19,
      "<a_27>": 20,
      "<a_44>": 21,
      "<a_55>": 22,
      "<a_64>": 23,
      "<a_69>": 24,
      "<a_6>": 25,
      "<b_102>": 26,
      "<b_104>": 27,
      "<b_110>": 28,
      "<b_119>": 29,
      "<b_122>": 30,
      "<b_134>": 31,
      "<b_135>": 32,
      "<b_138>": 33,
      "<b_140>": 34,
      "<b_141>": 35,
      "<b_147>": 36,
      "<b_151>": 37,
      "<b_157>": 38,
      "<b_163>": 39,
      "<b_165>": 40,
      "<b_182>": 41,
      "<b_198>": 42,
      "<b_203>": 43,
      "<b_207>": 44,
      "<b_213>": 45,
      "<b_214>": 46,
      "<b_218>": 47,
      "<b_219>": 48,
      "<b_21>": 49,
      "<b_226>": 50,
      "<b_236>": 51,
      "<b_237>": 52,
      "<b_23>": 53,
      "<b_240>": 54,
      "<b_242>": 55,
      "<b_252>": 56,
      "<b_25>": 57,
      "<b_2>": 58,
      "<b_31>": 59,
      "<b_33>": 60,
      "<b_35>": 61,
      "<b_36>": 62,
      "<b_39>": 63,
      "<b_3>": 64,
      "<b_41>": 65,
      "<b_44>": 66,
      "<b_45>": 67,
      "<b_46>": 68,
      "<b_4>": 69,
      "<b_51>": 70,
      "<b_60>": 71,
      "<b_67>": 72,
      "<b_72>": 73,
      "<b_77>": 74,
      "<b_84>": 75,
      "<b_85>": 76,
      "<b_87>": 77,
      "<b_89>": 78,
      "<b_8>": 79,
      "<b_92>": 80,
      "<b_97>": 81,
      "<c_0>": 82,
      "<c_103>": 83,
      "<c_109>": 84,
      "<c_111>": 85,
      "<c_113>": 86,
      "<c_114>": 87,
      "<c_116>": 88,
      "<c_120>": 89,
      "<c_123>": 90,
      "<c_124>": 91,
      "<c_130>": 92,
      "<c_132>": 93,
      "<c_133>": 94,
      "<c_134>": 95,
      "<c_135>": 96,
      "<c_13>": 97,
      "<c_141>": 98,
      "<c_143>": 99,
      "<c_144>": 100,
      "<c_145>": 101,
      "<c_146>": 102,
      "<c_147>": 103,
      "<c_148>": 104,
      "<c_149>": 105,
      "<c_150>": 106,
      "<c_151>": 107,
      "<c_156>": 108,
      "<c_157>": 109,
      "<c_15>": 110,
      "<c_160>": 111,
      "<c_166>": 112,
      "<c_168>": 113,
      "<c_16>": 114,
      "<c_170>": 115,
      "<c_171>": 116,
      "<c_172>": 117,
      "<c_173>": 118,
      "<c_178>": 119,
      "<c_179>": 120,
      "<c_180>": 121,
      "<c_181>": 122,
      "<c_184>": 123,
      "<c_185>": 124,
      "<c_186>": 125,
      "<c_187>": 126,
      "<c_190>": 127,
      "<c_192>": 128,
      "<c_194>": 129,
      "<c_195>": 130,
      "<c_196>": 131,
      "<c_197>": 132,
      "<c_199>": 133,
      "<c_207>": 134,
      "<c_208>": 135,
      "<c_20>": 136,
      "<c_212>": 137,
      "<c_215>": 138,
      "<c_221>": 139,
      "<c_222>": 140,
      "<c_226>": 141,
      "<c_227>": 142,
      "<c_228>": 143,
      "<c_229>": 144,
      "<c_22>": 145,
      "<c_234>": 146,
      "<c_237>": 147,
      "<c_238>": 148,
      "<c_239>": 149,
      "<c_23>": 150,
      "<c_241>": 151,
      "<c_242>": 152,
      "<c_243>": 153,
      "<c_245>": 154,
      "<c_246>": 155,
      "<c_247>": 156,
      "<c_252>": 157,
      "<c_254>": 158,
      "<c_26>": 159,
      "<c_27>": 160,
      "<c_28>": 161,
      "<c_31>": 162,
      "<c_32>": 163,
      "<c_33>": 164,
      "<c_34>": 165,
      "<c_40>": 166,
      "<c_41>": 167,
      "<c_42>": 168,
      "<c_43>": 169,
      "<c_44>": 170,
      "<c_45>": 171,
      "<c_49>": 172,
      "<c_56>": 173,
      "<c_65>": 174,
      "<c_68>": 175,
      "<c_69>": 176,
      "<c_73>": 177,
      "<c_75>": 178,
      "<c_77>": 179,
      "<c_78>": 180,
      "<c_80>": 181,
      "<c_84>": 182,
      "<c_88>": 183,
      "<c_8>": 184,
      "<c_93>": 185,
      "<c_96>": 186,
      "<c_97>": 187
    },
    "unk_token": "[UNK]"
  }
}